{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": true
    },
    {
      "id": 1,
      "content": "<s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": true
    },
    {
      "id": 2,
      "content": "</s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": true
    }
  ],
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {
        "type": "Prepend",
        "prepend": "▁"
      },
      {
        "type": "Replace",
        "pattern": {
          "String": " "
        },
        "content": "▁"
      }
    ]
  },
  "pre_tokenizer": null,
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {}
  },
  "decoder": {
    "type": "Sequence",
    "decoders": [
      {
        "type": "Replace",
        "pattern": {
          "String": "▁"
        },
        "content": " "
      },
      {
        "type": "ByteFallback"
      },
      {
        "type": "Fuse"
      },
      {
        "type": "Strip",
        "content": " ",
        "start": 1,
        "stop": 0
      }
    ]
  },
  "model": {
    "type": "Unigram",
    "unk_id": 0,
    "vocab": [
      [
        "<unk>",
        0.0
      ],
      [
        "<s>",
        0.0
      ],
      [
        "</s>",
        0.0
      ],
      [
        "▁",
        -0.5539144195601651
      ],
      [
        "a",
        -2.2064416411389463
      ],
      [
        "i",
        -3.466635627881617
      ],
      [
        "o",
        -3.6302539678733616
      ],
      [
        "d",
        -3.7153891435921143
      ],
      [
        "y",
        -3.897811635657046
      ],
      [
        "n",
        -3.919855954979644
      ],
      [
        "e",
        -3.9911629997498927
      ],
      [
        "u",
        -4.0180742087677
      ],
      [
        "l",
        -4.168391206311027
      ],
      [
        "h",
        -4.210532901132421
      ],
      [
        "s",
        -4.2601491895537755
      ],
      [
        "k",
        -4.263025062903383
      ],
      [
        "r",
        -4.364415000422529
      ],
      [
        "m",
        -4.662498554211757
      ],
      [
        "g",
        -4.675877221004374
      ],
      [
        "b",
        -4.772066336564857
      ],
      [
        "w",
        -5.025597158855605
      ],
      [
        "t",
        -5.033884093362797
      ],
      [
        "x",
        -5.037180808189493
      ],
      [
        "q",
        -5.573611642186311
      ],
      [
        "c",
        -5.6177722930111464
      ],
      [
        ",",
        -5.81258366596067
      ],
      [
        ".",
        -6.057175428378297
      ],
      [
        "S",
        -6.219207890333832
      ],
      [
        "f",
        -6.219461890843144
      ],
      [
        "M",
        -6.305852235100582
      ],
      [
        "j",
        -6.433659170346537
      ],
      [
        "A",
        -6.563389769918624
      ],
      [
        "W",
        -6.760459994042451
      ],
      [
        "D",
        -6.784126602616409
      ],
      [
        "C",
        -7.004358976010497
      ],
      [
        "I",
        -7.067217114312971
      ],
      [
        "-",
        -7.131000815454344
      ],
      [
        "G",
        -7.156479085144985
      ],
      [
        "B",
        -7.216054688459241
      ],
      [
        "K",
        -7.288686801618443
      ],
      [
        "X",
        -7.339695809727225
      ],
      [
        "H",
        -7.449557262840656
      ],
      [
        "0",
        -7.546598622750308
      ],
      [
        "1",
        -7.638209113026216
      ],
      [
        "Q",
        -7.719976479480545
      ],
      [
        "2",
        -7.805053289320613
      ],
      [
        "O",
        -7.842197528857515
      ],
      [
        "N",
        -7.912579666001729
      ],
      [
        "T",
        -7.9139616452068
      ],
      [
        "’",
        -7.938318952221799
      ],
      [
        "L",
        -7.962993851890575
      ],
      [
        "F",
        -8.010281876513604
      ],
      [
        "J",
        -8.058318555390159
      ],
      [
        "R",
        -8.058957839408407
      ],
      [
        "U",
        -8.148545017558195
      ],
      [
        "E",
        -8.237736517107784
      ],
      [
        ":",
        -8.451793202289736
      ],
      [
        ")",
        -8.509801664849718
      ],
      [
        "Y",
        -8.51989002258015
      ],
      [
        "(",
        -8.538309575943499
      ],
      [
        "P",
        -8.619493305905015
      ],
      [
        "'",
        -8.747161212899954
      ],
      [
        "p",
        -8.749709796544284
      ],
      [
        "\"",
        -8.800080154135863
      ],
      [
        "“",
        -8.800751295075461
      ],
      [
        "3",
        -8.815631514959229
      ],
      [
        "5",
        -8.878921523023607
      ],
      [
        "”",
        -8.900198920516278
      ],
      [
        "9",
        -8.931074865697449
      ],
      [
        "/",
        -9.003213895630164
      ],
      [
        "7",
        -9.01229735971634
      ],
      [
        "4",
        -9.035798230067195
      ],
      [
        "8",
        -9.074764196164931
      ],
      [
        "6",
        -9.095282309788589
      ],
      [
        "?",
        -9.440626560783722
      ],
      [
        "v",
        -9.505037773292152
      ],
      [
        "…",
        -9.891339320920329
      ],
      [
        ";",
        -10.06075740579379
      ],
      [
        "z",
        -10.065502370952348
      ],
      [
        "–",
        -10.256182075957271
      ],
      [
        "V",
        -10.259063920337674
      ],
      [
        "[",
        -10.425068963046094
      ],
      [
        "]",
        -10.459734444421589
      ],
      [
        "_",
        -10.559817788093572
      ],
      [
        "!",
        -10.591503565735302
      ],
      [
        "&",
        -10.9450209760225
      ],
      [
        "%",
        -10.950768102459282
      ],
      [
        "Z",
        -10.991950273593805
      ],
      [
        "$",
        -11.22036206728286
      ],
      [
        "‘",
        -11.27463868200622
      ],
      [
        "»",
        -11.568980883683892
      ],
      [
        "+",
        -11.635302850593265
      ],
      [
        "—",
        -11.682094478230688
      ],
      [
        "`",
        -11.865611707558497
      ],
      [
        "«",
        -12.165349569444173
      ],
      [
        "ö",
        -12.225365575846734
      ],
      [
        "​",
        -12.311436857581754
      ],
      [
        "�",
        -12.38122946807204
      ],
      [
        "ل",
        -12.656917555474331
      ],
      [
        "\\",
        -12.722508953323796
      ],
      [
        "´",
        -12.722508953323796
      ],
      [
        "•",
        -12.792705997658771
      ],
      [
        "*",
        -12.792705997658771
      ],
      [
        "ä",
        -12.949871239824011
      ],
      [
        "{",
        -13.038804046148124
      ],
      [
        "#",
        -13.086423093767172
      ],
      [
        "←",
        -13.136423093767172
      ],
      [
        "}",
        -13.18905467271454
      ],
      [
        "·",
        -13.18905467271454
      ],
      [
        "ا",
        -13.244610228270098
      ],
      [
        "£",
        -13.303433757681866
      ],
      [
        "→",
        -13.36593375768187
      ],
      [
        "=",
        -13.36593375768187
      ],
      [
        "€",
        -13.504028995777135
      ],
      [
        "é",
        -13.580952072700256
      ],
      [
        "ه",
        -13.755194496943052
      ],
      [
        "@",
        -13.855194496943824
      ],
      [
        "م",
        -13.855194496943824
      ],
      [
        ">",
        -13.96630560805741
      ],
      [
        "â",
        -13.96630560805741
      ],
      [
        "و",
        -14.091305608066516
      ],
      [
        "ي",
        -14.091305608066516
      ],
      [
        "‎",
        -14.091305608066516
      ],
      [
        "å",
        -14.234162750963618
      ],
      [
        "™",
        -14.234162750963618
      ],
      [
        "›",
        -14.400829417630284
      ],
      [
        "س",
        -14.400829417630284
      ],
      [
        "á",
        -14.400829417630284
      ],
      [
        "­",
        -14.400829417630284
      ],
      [
        "ü",
        -14.600829417630283
      ],
      [
        "ğ",
        -14.600829417630283
      ],
      [
        "ة",
        -14.600829417630283
      ],
      [
        "Ö",
        -14.600829417630283
      ],
      [
        "à",
        -14.600829417630283
      ],
      [
        "ص",
        -14.600829417630283
      ],
      [
        "ʼ",
        -14.850829417630283
      ],
      [
        "ø",
        -14.850829417630283
      ],
      [
        "ن",
        -14.850829417630283
      ],
      [
        "न",
        -14.850829417630283
      ],
      [
        "ع",
        -14.850829417630283
      ],
      [
        "👍",
        -14.850829417630283
      ],
      [
        "",
        -15.184162750963615
      ],
      [
        "♦",
        -15.184162750963615
      ],
      [
        "‬",
        -15.184162750963615
      ],
      [
        "Â",
        -15.184162750963615
      ],
      [
        "Δ",
        -15.184162750963615
      ],
      [
        "ó",
        -15.184162750963615
      ],
      [
        "ﷺ",
        -15.184162750963615
      ],
      [
        "è",
        -15.184162750963615
      ],
      [
        "Ø",
        -15.184162750963615
      ],
      [
        "í",
        -15.184162750963615
      ],
      [
        "ř",
        -15.184162750963615
      ],
      [
        "ض",
        -15.184162750963615
      ],
      [
        "ى",
        -15.184162750963615
      ],
      [
        "ر",
        -15.184162750963615
      ],
      [
        "Ä",
        -15.68416275096362
      ],
      [
        "‪",
        -15.68416275096362
      ],
      [
        "️",
        -15.68416275096362
      ],
      [
        "‫",
        -15.68416275096362
      ],
      [
        "👇",
        -15.68416275096362
      ],
      [
        "Ç",
        -15.68416275096362
      ],
      [
        "ा",
        -15.68416275096362
      ],
      [
        "्",
        -15.68416275096362
      ],
      [
        "β",
        -15.68416275096362
      ],
      [
        "Å",
        -15.68416275096362
      ],
      [
        "स",
        -15.68416275096362
      ],
      [
        "ं",
        -15.68416275096362
      ],
      [
        "त",
        -15.68416275096362
      ],
      [
        "ح",
        -15.68416275096362
      ],
      [
        "ف",
        -15.68416275096362
      ],
      [
        "″",
        -15.68416275096362
      ],
      [
        "─",
        -15.68416275096362
      ],
      [
        "Α",
        -15.68416275096362
      ],
      [
        "र",
        -15.68416275096362
      ],
      [
        "ئ",
        -15.68416275096362
      ],
      [
        "",
        -15.68416275096362
      ],
      [
        "ş",
        -15.68416275096362
      ],
      [
        "अ",
        -15.68416275096362
      ],
      [
        "",
        -15.68416275096362
      ],
      [
        "ì",
        -15.68416275096362
      ],
      [
        "′",
        -15.68416275096362
      ],
      [
        "<",
        -15.68416275096362
      ],
      [
        "±",
        -15.68416275096362
      ],
      [
        "",
        -15.68416275096362
      ],
      [
        "ء",
        -16.68416275096362
      ],
      [
        "û",
        -16.68416275096362
      ],
      [
        "ि",
        -16.68416275096362
      ],
      [
        "š",
        -16.68416275096362
      ],
      [
        "↑",
        -16.68416275096362
      ],
      [
        "²",
        -16.68416275096362
      ],
      [
        "د",
        -16.68416275096362
      ],
      [
        "Þ",
        -16.68416275096362
      ],
      [
        "ष",
        -16.68416275096362
      ],
      [
        "‏",
        -16.68416275096362
      ],
      [
        "©",
        -16.68416275096362
      ],
      [
        "ý",
        -16.68416275096362
      ],
      [
        "ù",
        -16.68416275096362
      ],
      [
        "ु",
        -16.68416275096362
      ],
      [
        "~",
        -16.68416275096362
      ],
      [
        "×",
        -16.68416275096362
      ],
      [
        "ô",
        -16.68416275096362
      ],
      [
        "ग",
        -16.68416275096362
      ],
      [
        "ج",
        -16.68416275096362
      ],
      [
        "Š",
        -16.68416275096362
      ],
      [
        "∓",
        -16.68416275096362
      ],
      [
        "🙁",
        -16.68416275096362
      ],
      [
        "भ",
        -16.68416275096362
      ],
      [
        "▪",
        -16.68416275096362
      ],
      [
        "",
        -16.68416275096362
      ],
      [
        "°",
        -16.68416275096362
      ],
      [
        "ﺮ",
        -16.68416275096362
      ],
      [
        "ã",
        -16.68416275096362
      ],
      [
        "œ",
        -16.68416275096362
      ],
      [
        "ी",
        -16.68416275096362
      ],
      [
        "ق",
        -16.68416275096362
      ],
      [
        "►",
        -16.68416275096362
      ],
      [
        "\u0012",
        -16.68416275096362
      ],
      [
        "क",
        -16.68416275096362
      ],
      [
        "ك",
        -16.68416275096362
      ],
      [
        "ب",
        -16.68416275096362
      ],
      [
        "🤔",
        -16.68416275096362
      ],
      [
        "ظ",
        -16.68416275096362
      ],
      [
        "↓",
        -16.68416275096362
      ],
      [
        "č",
        -16.68416275096362
      ],
      [
        "",
        -16.68416275096362
      ],
      [
        "Ð",
        -16.68416275096362
      ],
      [
        "Ÿ",
        -16.68416275096362
      ],
      [
        "Η",
        -16.68416275096362
      ],
      [
        "ث",
        -16.68416275096362
      ],
      [
        "",
        -16.68416275096362
      ],
      [
        "ध",
        -16.68416275096362
      ],
      [
        "ت",
        -16.68416275096362
      ],
      [
        "¸",
        -16.68416275096362
      ],
      [
        "Κ",
        -16.68416275096362
      ],
      [
        "ć",
        -16.68416275096362
      ],
      [
        "ﻗ",
        -16.68416275096362
      ],
      [
        "😉",
        -16.68416275096362
      ],
      [
        "ú",
        -16.68416275096362
      ],
      [
        "В",
        -16.68416275096362
      ],
      [
        "￼",
        -16.68416275096362
      ],
      [
        "ë",
        -16.68416275096362
      ],
      [
        "½",
        -16.68416275096362
      ],
      [
        "|",
        -16.68416275096362
      ],
      [
        "∑",
        -16.68416275096362
      ],
      [
        "य",
        -16.68416275096362
      ],
      [
        "ठ",
        -16.68416275096362
      ],
      [
        "õ",
        -16.68416275096362
      ],
      [
        "إ",
        -16.68416275096362
      ],
      [
        "ł",
        -16.68416275096362
      ],
      [
        "¿",
        -16.68416275096362
      ],
      [
        "Ü",
        -16.68416275096362
      ],
      [
        "ç",
        -16.68416275096362
      ],
      [
        "ï",
        -16.68416275096362
      ],
      [
        "ě",
        -16.68416275096362
      ],
      [
        "ﺃ",
        -16.68416275096362
      ],
      [
        "\n",
        -16.68416275096362
      ]
    ],
    "byte_fallback": false
  }
}